<?php
return [

    /*
    |--------------------------------------------------------------------------
    | 接口安全配置
    |--------------------------------------------------------------------------
    |
    | ip_limit: 是否开启IP验证限制。如果开启，无法命中配置的IP要求，会被驳回
    | api_rate: 是否开启API请求速率限制。如果开启，超过API要求的速率，会被驳回
    | route_limit: 是否开启API路由请求白名单限制。如果开启，则不在白名单的请求路由，会被驳回
    |
    */
    'ip_limit' => true,
    'api_rate' => true,
    'route_limit' => true,

    /*
    |--------------------------------------------------------------------------
    | Mysql Redis Databases
    |--------------------------------------------------------------------------
    |
    | 有状态的服务配置
    | 配置不同的连接名称，则会使用不同的服务连接
    | 请在 config/database.php 文件中的 connections.mysql 和 connections.redis 确定不同的连接名称，修改下方的配置文件
    |
    */
    'mysql_connect_name' => 'default',
    'redis_connect_name' => 'default',

];